[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  // Stryker disable next-line ConditionalExpression
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:20:18
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression
-  if (n === 0 || n === 1) return 1;
+  if (n === 0 || n !== 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:22:19
   // Stryker disable next-line ConditionalExpression
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
+  for (let i = 2; i > n; i++) { resultado *= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:44:28
 }
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
-function isPar(n) { return n % 2 === 0; }
+function isPar(n) { return true; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/operacoes.js:45:30
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
-function isImpar(n) { return n % 2 !== 0; }
+function isImpar(n) { return true; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 16. deve retornar true para um número ímpar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/operacoes.js:46:59
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
-function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
+function calcularPorcentagem(percentual, valor) { return (valor / percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0.04

[Killed] ArithmeticOperator
src/operacoes.js:47:67
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
-function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
+function aumentarPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 90

Expected precision:    2
Expected difference: < 0.005
Received difference:   20

[Killed] ArithmeticOperator
src/operacoes.js:48:67
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
-function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
+function diminuirPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function inverterSinal(n) { return -n; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 110.00000000000001

Expected precision:    2
Expected difference: < 0.005
Received difference:   20.000000000000014

[Timeout] ArithmeticOperator
src/operacoes.js:67:27
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { // Máximo Divisor Comum
-  while(b) { [a, b] = [b, a % b]; }
+  while(b) { [a, b] = [b, a * b]; }
   return a;
 }

[Killed] BlockStatement
src/operacoes.js:75:31
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
-  }
+  for (let i = 2; i < n; i++) {}
   return true;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/operacoes.js:81:7
   return true;
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (false) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
src/operacoes.js:84:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  // Stryker disable next-line ConditionalExpression
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor < min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:86:7
 }
 function produtoArray(numeros) {
   // Stryker disable next-line ConditionalExpression
-  if (numeros.length === 0) return 1;
+  if (numeros.length !== 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   if (valor < min) return min;
-  if (valor > max) return max;
+  if (valor >= max) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"valueOf": [Function valueOf]}
Received: serializes to the same string

[Killed] ConditionalExpression
src/operacoes.js:106:36
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return false; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/operacoes.js:113:7
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
+  if (sorted.length * 2 === 0) {
     return (sorted[mid - 1] + sorted[mid]) / 2;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] ArithmeticOperator
src/operacoes.js:114:13
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
+    return (sorted[mid - 1] - sorted[mid]) / 2;
   }
   return sorted[mid];
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: -0.5
